#!/bin/bash
#
# Btrfscreate v2.0
# ----------------------------------------|
#           :
# Author    : LinuxShef
#           :
# Project   : https://github.com/shefpower/btrfscreate.git
#           :
# License   : LGPL-3.0 (http://opensource.org/licenses/lgpl-3.0.html)
#           :
#----------------------------------------------------------------------|
clear
echo '
$$$$$$$\    $$\                $$$$$$\                                                    $$\
$$  __$$\   $$ |              $$  __$$\                                                   $$ |
$$ |  $$ |$$$$$$\    $$$$$$\  $$ /  \__|$$$$$$$\  $$$$$$$\  $$$$$$\   $$$$$$\   $$$$$$\ $$$$$$\    $$$$$$\
$$$$$$$\ |\_$$  _|  $$  __$$\ $$$$\    $$  _____|$$  _____|$$  __$$\ $$  __$$\  \____$$\\_$$  _|  $$  __$$\
$$  __$$\   $$ |    $$ |  \__|$$  _|   \$$$$$$\  $$ /      $$ |  \__|$$$$$$$$ | $$$$$$$ | $$ |    $$$$$$$$ |
$$ |  $$ |  $$ |$$\ $$ |      $$ |      \____$$\ $$ |      $$ |      $$   ____|$$  __$$ | $$ |$$\ $$   ____|
$$$$$$$  |  \$$$$  |$$ |      $$ |     $$$$$$$  |\$$$$$$$\ $$ |      \$$$$$$$\ \$$$$$$$ | \$$$$  |\$$$$$$$\
\_______/    \____/ \__|      \__|     \_______/  \_______|\__|       \_______| \_______|  \____/  \_______|
'
sleep 2
#----------------------------------------------------------------------|
clear
echo '
 $$$$$$\              $$\     $$\
$$  __$$\             $$ |    $$ |
$$ /  $$ |$$\   $$\ $$$$$$\   $$$$$$$\   $$$$$$\   $$$$$$\
$$$$$$$$ |$$ |  $$ |\_$$  _|  $$  __$$\ $$  __$$\ $$  __$$\
$$  __$$ |$$ |  $$ |  $$ |    $$ |  $$ |$$ /  $$ |$$ |  \__|
$$ |  $$ |$$ |  $$ |  $$ |$$\ $$ |  $$ |$$ |  $$ |$$ |
$$ |  $$ |\$$$$$$  |  \$$$$  |$$ |  $$ |\$$$$$$  |$$ |
\__|  \__| \______/    \____/ \__|  \__| \______/ \__|



$$\       $$\                                $$$$$$\  $$\                  $$$$$$\
$$ |      \__|                              $$  __$$\ $$ |                $$  __$$\
$$ |      $$\ $$$$$$$\  $$\   $$\ $$\   $$\ $$ /  \__|$$$$$$$\   $$$$$$\  $$ /  \__|
$$ |      $$ |$$  __$$\ $$ |  $$ |\$$\ $$  |\$$$$$$\  $$  __$$\ $$  __$$\ $$$$\
$$ |      $$ |$$ |  $$ |$$ |  $$ | \$$$$  /  \____$$\ $$ |  $$ |$$$$$$$$ |$$  _|
$$ |      $$ |$$ |  $$ |$$ |  $$ | $$  $$<  $$\   $$ |$$ |  $$ |$$   ____|$$ |
$$$$$$$$\ $$ |$$ |  $$ |\$$$$$$  |$$  /\$$\ \$$$$$$  |$$ |  $$ |\$$$$$$$\ $$ |
\________|\__|\__|  \__| \______/ \__/  \__| \______/ \__|  \__| \_______|\__|
'
sleep 2
#----------------------------------------------------------------------|
#                                                      #
#               Change of localization                 #
#                                                      #
#----------------------------------------------------------------------|
clear
echo '
            ────────────────────────────────────────────────────────────────────────


                 ██╗      ██████╗  █████╗ ██████╗ ██╗███╗   ██╗ ██████╗
                 ██║     ██╔═══██╗██╔══██╗██╔══██╗██║████╗  ██║██╔════╝
                 ██║     ██║   ██║███████║██║  ██║██║██╔██╗ ██║██║  ███╗
                 ██║     ██║   ██║██╔══██║██║  ██║██║██║╚██╗██║██║   ██║
                 ███████╗╚██████╔╝██║  ██║██████╔╝██║██║ ╚████║╚██████╔╝██╗██╗██╗
                 ╚══════╝ ╚═════╝ ╚═╝  ╚═╝╚═════╝ ╚═╝╚═╝  ╚═══╝ ╚═════╝ ╚═╝╚═╝╚═╝


            ─────────────────────────────────────────────────────────────────────────
'
setfont cyr-sun16
clear

echo '
                                        Выбор разделов

      .────────────────────────────────────────────────────────────────────────────────.
      .                                                                                .
      .                                                                                .
      .                             Введите разделы диска                              .
      .                                                                                .
      .             (Root- Корневой)  (Boot- Загрузочный) (Swap- Подкачка)             .
      .                                                                                .
      .                                                                                .
      .                  Например ( sda2, sdb2, sdc2 , nvme0n1p2 )                     .
      .                                                                                .
      .                                                                                .
      .                                                                                .
      .                                                                                .
      .────────────────────────────────────────────────────────────────────────────────.

'
read -p "
                                 -> Boot: " boot
read -p "
                                 -> Root: " root
read -p "
                                 -> Swap: " swap

clear

echo '
                          Выбор файловой системы Boot раздела

              .─────────────────────────────────────────────────────────────.
              .                                                             .
              .                                                             .
              .      Выберите файловую систему загрузочного  boot раздела   .
              .                                                             .
              .  Согласно вашей версии Bios (обычный стрый BIOS или UEFI)   .
              .                                                             .
              .   Для UEFI формат FAT32 . Для обычнго BIOS Ext4 или Ext2    .
              .                                                             .
              .                                                             .
              .─────────────────────────────────────────────────────────────.

'
echo -e "\t

                       -> Для UEFI введите     1    "
echo -e "\t



                       -> Не форматировать  введите      2

                      ( Для установки в один раздел DOS/MBR или рядом с Windows )"
echo -e "\t




                       -> Для обычного Bios форматировать в Ext4 введите    3   "
echo -e "\t


                       -> Для обычного Bios фоматировать в Ext2 введиет    4   "
echo -n "


                           -> Введите значение : "
read main_menu
      case "$main_menu" in
         "1" ) clear ; mkfs.vfat -F32 /dev/$boot
         ;;
         "3" ) clear ; mkfs.ext4 /dev/$boot
         ;;
         "4" ) clear ; mkfs.ext2 /dev/$boot
         ;;
         "2" ) clear
      esac

clear
mkfs.btrfs -f /dev/$root
mkswap /dev/$swap
swapon /dev/$swap
clear


echo '
                                 Монтирование BTRFS для SSD и HDD

                 .───────────────────────────────────────────────────────.
                 .                                                       .
                 .                                                       .
                 .       Выберите один из вариантов монтирования         .
                 .                                                       .
                 .                                                       .
                 .───────────────────────────────────────────────────────.
'
echo -e "\t


                     ->  Смонтировать для HDD     1     "

echo -e "\t

                     ->  Cмонтрировать для SSD    2    "

echo -n "

                      -> Введите значение : "

read main_menu
      case "$main_menu" in
        "1") clear ;
mount  /dev/$root /mnt

btrfs su cr /mnt/@

btrfs su cr /mnt/@home

umount /mnt

mount -o rw,relatime,compress=zstd:3,max_inline=256,commit=120,autodefrag,subvol=@ /dev/$root /mnt

mkdir /mnt/{boot,home}

mount -o rw,relatime,compress=zstd:2,max_inline=256,commit=120,autodefrag,subvol=@home  /dev/$root  /mnt/home
        ;;
        "2" ) clear ;

mount  /dev/$root /mnt

btrfs su cr /mnt/@

btrfs su cr /mnt/@home

umount /mnt

mount -o rw,relatime,compress=zstd:2,ssd_spread,max_inline=256,commit=120,subvol=@ /dev/$root /mnt

mkdir /mnt/{boot,home}

mount -o rw,relatime,compress=zstd:2,ssd_spread,max_inline=256,commit=120,subvol=@home  /dev/$root  /mnt/home
   esac

clear
echo '
                              Монтирование boot раздела

               .─────────────────────────────────────────────────────────.
               .                                                         .
               .                                                         .
               .          Монтирование загрузочного раздела !            .
               .                                                         .
               .    Выберите один из варинтов монтирования boot раздела  .
               .                                                         .
               .        Для обычного биоса (НЕ UEFI) введите Bios        .
               .                                                         .
               .              Для UEFI биоса , введите Uefi              .
               .                                                         .
               .                                                         .
               .─────────────────────────────────────────────────────────.
'
echo -e "\t

                        -> Для UEFI или EFI введите     1    "
echo -e "\t


                        -> Для обычного Bios введите    2    "
echo -n "


                        -> Введите значение : "
read main_menu
      case "$main_menu" in
         "1" ) mkdir /mnt/boot/efi ; mount /dev/$boot /mnt/boot/efi
         ;;
         "2" ) mount /dev/$boot  /mnt/boot/
      esac

clear
lsblk
